GitConverter/src/DataProcessors/ОбработкаЗаявок/ОбработкаЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаЗаявок</name>
  <comment>Обработка для просмотра и обработки поступивших заявок</comment>
</mdclass:DataProcessor>

GitConverter/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <comment>Перечисление статусов заявок</comment>
  <enumValues>
    <name>Открыта</name>
    <comment>Заявка подана и ожидает рассмотрения</comment>
  </enumValues>
  <enumValues>
    <name>Одобрена</name>
    <comment>Заявка одобрена администратором</comment>
  </enumValues>
  <enumValues>
    <name>Отказано</name>
    <comment>В заявке отказано администратором</comment>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Документ для регистрации заявок на отгул, отпуск, больничный, жалоб и пожеланий</comment>
  <registerRecords>InformationRegister.СостоянияВерсии</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <comment>Физическое лицо, подающее заявку</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <comment>Тип заявки (отгул, отпуск, больничный, жалобы/пожелания)</comment>
    <type>
      <types>CatalogRef.ТипыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала периода для отгула, отпуска, больничного</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания периода для отгула, отпуска, больничного</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <comment>Причина или описание заявки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус заявки (Открыта, Одобрена, Отказано)</comment>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработчика</name>
    <comment>Комментарий администратора при обработке заявки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата и время обработки заявки администратором</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

GitConverter/src/DataProcessors/ОбработкаЗаявок/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализируем таблицу заявок
	ИнициализироватьТаблицуЗаявок();
	
	// Загружаем список заявок
	ЗагрузитьСписокЗаявок();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТаблицуЗаявок()
	
	// Создаем колонки таблицы заявок
	СписокЗаявок.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.Заявка"), "Ссылка", 0);
	СписокЗаявок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"), "Номер", 15);
	СписокЗаявок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"), "Дата", 12);
	СписокЗаявок.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"), "Физическое лицо", 30);
	СписокЗаявок.Колонки.Добавить("ТипЗаявки", Новый ОписаниеТипов("СправочникСсылка.ТипыЗаявок"), "Тип заявки", 20);
	СписокЗаявок.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"), "Дата начала", 12);
	СписокЗаявок.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"), "Дата окончания", 12);
	СписокЗаявок.Колонки.Добавить("Причина", Новый ОписаниеТипов("Строка"), "Причина", 40);
	СписокЗаявок.Колонки.Добавить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗаявок"), "Статус", 15);
	СписокЗаявок.Колонки.Добавить("ЦветСтатуса", Новый ОписаниеТипов("ЦветWeb"), "Цвет статуса", 0);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокЗаявок()
	
	СписокЗаявок.Очистить();
	
	// Формируем запрос для получения заявок
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	Заявка.Номер КАК Номер,
	|	Заявка.Дата КАК Дата,
	|	Заявка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Заявка.ТипЗаявки КАК ТипЗаявки,
	|	Заявка.ДатаНачала КАК ДатаНачала,
	|	Заявка.ДатаОкончания КАК ДатаОкончания,
	|	Заявка.Причина КАК Причина,
	|	Заявка.Статус КАК Статус
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	НЕ Заявка.ПометкаУдаления";
	
	// Добавляем условия отбора
	УсловияОтбора = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтборПоТипу) Тогда
		УсловияОтбора.Добавить("Заявка.ТипЗаявки = &ОтборПоТипу");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПоСтатусу) Тогда
		УсловияОтбора.Добавить("Заявка.Статус = &ОтборПоСтатусу");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПоПользователю) Тогда
		УсловияОтбора.Добавить("Заявка.ФизическоеЛицо = &ОтборПоПользователю");
	КонецЕсли;
	
	Если УсловияОтбора.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И " + СтрСоединить(УсловияОтбора, "
		|	И ");
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявка.Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(ОтборПоТипу) Тогда
		Запрос.УстановитьПараметр("ОтборПоТипу", ОтборПоТипу);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПоСтатусу) Тогда
		Запрос.УстановитьПараметр("ОтборПоСтатусу", ОтборПоСтатусу);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПоПользователю) Тогда
		Запрос.УстановитьПараметр("ОтборПоПользователю", ОтборПоПользователю);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокЗаявок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		// Устанавливаем цвет статуса
		Если Выборка.Статус = Перечисления.СтатусыЗаявок.Одобрена Тогда
			НоваяСтрока.ЦветСтатуса = ЦветаСтиля.ЦветТекстаПоложительногоЧисла;
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявок.Отказано Тогда
			НоваяСтрока.ЦветСтатуса = ЦветаСтиля.ЦветТекстаОтрицательногоЧисла;
		Иначе
			НоваяСтрока.ЦветСтатуса = ЦветаСтиля.ТекстОбычныйЦвет;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипуПриИзменении(Элемент)
	ЗагрузитьСписокЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	ЗагрузитьСписокЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПользователюПриИзменении(Элемент)
	ЗагрузитьСписокЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗагрузитьСписокЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокЗаявок.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Одобрить(Команда)
	
	ТекущиеДанные = Элементы.СписокЗаявок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать заявку!");
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Открыта") Тогда
		ПоказатьПредупреждение(, "Можно обрабатывать только открытые заявки!");
		Возврат;
	КонецЕсли;
	
	// Запрашиваем комментарий
	ДополнительныеПараметры = Новый Структура("Действие, Ссылка", "Одобрить", ТекущиеДанные.Ссылка);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОбработатьЗаявкуЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
		"", "Введите комментарий к одобрению заявки (необязательно):", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отказать(Команда)
	
	ТекущиеДанные = Элементы.СписокЗаявок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать заявку!");
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Открыта") Тогда
		ПоказатьПредупреждение(, "Можно обрабатывать только открытые заявки!");
		Возврат;
	КонецЕсли;
	
	// Запрашиваем причину отказа
	ДополнительныеПараметры = Новый Структура("Действие, Ссылка", "Отказать", ТекущиеДанные.Ссылка);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОбработатьЗаявкуЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
		"", "Введите причину отказа:", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаявкуЗавершение(ВведенныйТекст, ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Если отказываем, комментарий обязателен
	Если ДополнительныеПараметры.Действие = "Отказать" И ПустаяСтрока(ВведенныйТекст) Тогда
		ПоказатьПредупреждение(, "При отказе в заявке необходимо указать причину!");
		Возврат;
	КонецЕсли;
	
	Если ОбработатьЗаявкуНаСервере(ДополнительныеПараметры.Ссылка, ДополнительныеПараметры.Действие, ВведенныйТекст) Тогда
		ПоказатьПредупреждение(, "Заявка успешно обработана!");
		ЗагрузитьСписокЗаявок();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьЗаявкуНаСервере(СсылкаНаЗаявку, Действие, Комментарий)
	
	Попытка
		
		ДокументОбъект = СсылкаНаЗаявку.ПолучитьОбъект();
		
		Если Действие = "Одобрить" Тогда
			ДокументОбъект.Статус = Перечисления.СтатусыЗаявок.Одобрена;
		ИначеЕсли Действие = "Отказать" Тогда
			ДокументОбъект.Статус = Перечисления.СтатусыЗаявок.Отказано;
		КонецЕсли;
		
		ДокументОбъект.КомментарийОбработчика = Комментарий;
		ДокументОбъект.ДатаОбработки = ТекущаяДатаСеанса();
		
		ДокументОбъект.Записать();
		
		Возврат Истина;
		
	Исключение
		ПоказатьПредупреждение(, "Ошибка при обработке заявки: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
